In [1]:
%load_ext sql

In [2]:
%sql sqlite:///nueva.sqlite

In [3]:
%%sql

CREATE TABLE alumnos (id INTEGER NOT NULL, 
                      nombre VARCHAR(50) NOT NULL, 
                      clase VARCHAR(30) DEFAULT "SQL",
                      fecha_de_ingreso DATE NOT NULL);

 * sqlite:///nueva.sqlite
(sqlite3.OperationalError) table alumnos already exists
[SQL: CREATE TABLE alumnos (id INTEGER NOT NULL,
                      nombre VARCHAR(50) NOT NULL,
                      clase VARCHAR(30) DEFAULT "SQL",
                      fecha_de_ingreso DATE NOT NULL);]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [4]:
%sql INSERT INTO alumnos (id, nombre, fecha_de_ingreso) VALUES (1, "Jorge", "01-01-2023");

 * sqlite:///nueva.sqlite
1 rows affected.

[]

In [5]:
%sql SELECT * FROM alumnos;

 * sqlite:///nueva.sqlite
Done.

[(1, 'Xavier', '2023-02-04'),
 (2, 'Ana', '2023-01-15'),
 (3, 'Rodrigo', '2023-02-02'),
 (4, 'Susana', '2023-01-01'),
 (5, 'Jose', '2023-02-01'),
 (6, 'Luis', '2023-02-01'),
 (7, 'Omar', '2023-02-01'),
 (1, 'Jorge', '01-01-2023')]

In [6]:
%sql ALTER TABLE alumnos ADD puntaje INTEGER;

 * sqlite:///nueva.sqlite
Done.

[]

In [7]:
%sql SELECT * FROM alumnos;

 * sqlite:///nueva.sqlite
Done.

[(1, 'Xavier', '2023-02-04', None),
 (2, 'Ana', '2023-01-15', None),
 (3, 'Rodrigo', '2023-02-02', None),
 (4, 'Susana', '2023-01-01', None),
 (5, 'Jose', '2023-02-01', None),
 (6, 'Luis', '2023-02-01', None),
 (7, 'Omar', '2023-02-01', None),
 (1, 'Jorge', '01-01-2023', None)]

In [8]:
%%sql 

INSERT INTO alumnos 
(id, nombre, fecha_de_ingreso)
VALUES 
(4, "Susana", "01-01-2023"),
(5, "Jose", "01-02-2023"),
(6, "Luis", "01-02-2023"),
(7, "Omar", "01-02-2023");

 * sqlite:///nueva.sqlite
4 rows affected.

[]

In [9]:
%sql ALTER TABLE alumnos DROP puntaje;

 * sqlite:///nueva.sqlite
Done.

[]

In [10]:
%sql SELECT nombre, id, fecha_de_ingreso, nombre FROM alumnos;

 * sqlite:///nueva.sqlite
(sqlite3.OperationalError) no such column: clase
[SQL: SELECT nombre, clase, id, fecha_de_ingreso, nombre FROM alumnos;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [12]:
%sql UPDATE alumnos SET fecha_de_ingreso = "01-03-2023" WHERE id = 4;

 * sqlite:///nueva.sqlite
2 rows affected.

[]

In [14]:
%sql DELETE FROM alumnos WHERE nombre = "Omar";

 * sqlite:///nueva.sqlite
2 rows affected.

[]

In [15]:
%sql DELETE FROM alumnos;

 * sqlite:///nueva.sqlite
10 rows affected.

[]

In [16]:
%sql DROP TABLE alumnos;

 * sqlite:///nueva.sqlite
Done.

[]